src/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ОсновныеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/УстановкаОкладовСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>УстановкаОкладовСотрудников</Name>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОкладыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Оклады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НачисленияВидНачисленияПриИзменении(Элемент)
	ОбновитьРазмер(Истина, Элементы.Начисления.ТекущиеДанные.НомерСтроки);
КонецПроцедуры

&НаСервере
Функция ПолучитьРазмерНаСервере(НомерСтроки, СообщатьОшибку)
	Начисление = Объект.Начисления[НомерСтроки - 1];
	Если Начисление.ВидНачисления = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
		Возврат ПолучитьСписокОкладов(Начисление, СообщатьОшибку);
	ИначеЕсли Начисление.ВидНачисления = ПланыВидовРасчета.ОсновныеНачисления.Больничный Тогда
		Начисление.Размер = Константы.СтавкаПоБольничномуВДень.Получить();
	ИначеЕсли Начисление.ВидНачисления = ПланыВидовРасчета.ОсновныеНачисления.Командировка Тогда
		Возврат ПолучитьСписокОкладов(Начисление, СообщатьОшибку);
		// Начисление.Размер = Константы.КомандировочныеВДень.Получить();
	КонецЕсли;
	Возврат Неопределено; 
КонецФункции

&НаСервере
Функция ПолучитьСписокОкладов(Начисление, СообщатьОшибку)
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Сотрудники = Новый Массив;
	Сотрудники.Добавить(Начисление.Сотрудник);
	Результат = ДокОбъект.ПолучитьСписокОкладов(Сотрудники, Начисление.ДатаНачала)[0];
	Если Результат.Оклад.Количество() = 0 Тогда
		Если СообщатьОшибку Тогда
			СообщатьОшибку = "Для сотрудника " + Начисление.Сотрудник 
				+ " не установлен оклад. Создать новый документ установки оклада?";
		КонецЕсли;
	Иначе
		Возврат Результат;
	КонецЕсли; 
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура СоздатьДокументУстановкаОкладов(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Начисление = Элементы.Начисления.ТекущиеДанные;
		СсылкаНового = СоздатьДокументУстановкаОкладовНаСервере(Начисление.Сотрудник, Начисление.ДатаНачала);
		ОткрытьФорму("Документ.УстановкаОкладовСотрудников.ФормаОбъекта"
					, Новый Структура("Ключ", СсылкаНового));
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьДокументУстановкаОкладовНаСервере(Сотрудник, Дата)
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	УстановкаОкладов = Документы.УстановкаОкладовСотрудников.СоздатьДокумент();
	УстановкаОкладов.Заполнить(Сотрудник);
	УстановкаОкладов.Дата = Дата;
	УстановкаОкладов.Записать();
	Возврат УстановкаОкладов.Ссылка;
КонецФункции

&НаКлиенте
Процедура ОбновитьРазмер(ОчиститьПустой, НомерСтроки)
	Начисление = Объект.Начисления[НомерСтроки - 1];
	ТекЭлемент = Элементы.НачисленияРазмер;
	ТекЭлемент.СписокВыбора.Очистить();
	Ошибка = ОчиститьПустой;
	Если ЗначениеЗаполнено(Начисление.ДатаНачала) Тогда
		ТекСписокВыбора = ПолучитьРазмерНаСервере(НомерСтроки, Ошибка);
	КонецЕсли; 
	Если ТипЗнч(Ошибка) <> Тип("Булево") Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьДокументУстановкаОкладов",ЭтаФорма), Ошибка, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли; 
	Если ТекСписокВыбора <> Неопределено Тогда
		Оклады = ТекСписокВыбора.Оклад;
		Для Индекс = 0 По Оклады.ВГраница() Цикл
			Расшифровка = "" + ТекСписокВыбора.Должность[Индекс];
			ТекЭлемент.СписокВыбора.Добавить(Оклады[Индекс], Расшифровка); 
		КонецЦикла;
		Если Оклады.Количество() = 1 Тогда
			ВыбратьОклад(Оклады[0]);
		ИначеЕсли ОчиститьПустой И Не ЗначениеЗаполнено(Начисление.Размер) Тогда 
			ВыбратьОклад(0);
		КонецЕсли;
	Иначе
		ВыбратьОклад(0);
	КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
Процедура НачисленияПриАктивизацииЯчейки(Элемент)
	Если Элемент.ТекущийЭлемент.Имя = "НачисленияРазмер" Тогда
		ОбновитьРазмер(Ложь, Элементы.Начисления.ТекущиеДанные.НомерСтроки);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникПриИзменении(Элемент)
	Начисление = Элементы.Начисления.ТекущиеДанные;
	Начисление.Размер = 0;
	ОбновитьРазмер(Истина, Начисление.НомерСтроки);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДатаНачалаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НомерСтроки = Элементы.Начисления.ТекущиеДанные.НомерСтроки;
	Начисления = Объект.Начисления[НомерСтроки - 1];
	Если Месяц(Начисления.ДатаНачала) <> Месяц(ВыбранноеЗначение) 
	 ИЛИ Год(Начисления.ДатаНачала) <> Год(ВыбранноеЗначение) Тогда
	    
	    СтандартнаяОбработка  = Ложь;
	    Начисления.ДатаНачала = ВыбранноеЗначение;
		ОбновитьРазмер(Истина, НомерСтроки);
	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОклад(Значение)
	Элемент    = Элементы.НачисленияРазмер;
	Начисление = Элементы.Начисления.ТекущиеДанные;	
	Если Значение = 0 Тогда
		Начисление.Должность     = Неопределено;
		Начисление.Подразделение = Неопределено;
		Начисление.Размер = 0;	
	Иначе
		// !!! При одинаковых окладах находит первую запись
		Индекс = Элемент.СписокВыбора.Индекс(Элемент.СписокВыбора.НайтиПоЗначению(Значение)); 
		Начисление.Должность     = ТекСписокВыбора.Должность[Индекс];
		Начисление.Подразделение = ТекСписокВыбора.Подразделение[Индекс];
		Начисление.Размер 		 = ТекСписокВыбора.Оклад[Индекс];
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура НачисленияРазмерПриИзменении(Элемент)
	ВыбратьОклад(Элементы.Начисления.ТекущиеДанные.Размер);
КонецПроцедуры
